vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA185_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_data_integrity" Cversion="1.0.0" condition="component.sgi_pkc.data_integrity.condition_id">
      <description>Component sgi_pkc data_integrity</description>
      <files>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_AssemblyMacros.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_Cfg.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_Impl.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_None.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_SecureCounter.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxCsslDataIntegrity/inc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_dma" Cversion="1.0.0" condition="component.sgi_pkc.dma.condition_id">
      <description>Component dma</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClDma/src/mcuxClDma_Drv.c" projectpath="component/sgi_pkc/src/comps/mcuxClDma/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClDma/src/mcuxClDma_Resource.c" projectpath="component/sgi_pkc/src/comps/mcuxClDma/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClDma/src/mcuxClDma_Utils.c" projectpath="component/sgi_pkc/src/comps/mcuxClDma/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClDma/src/mcuxClDma_Utils_Sgi.c" projectpath="component/sgi_pkc/src/comps/mcuxClDma/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/mcuxClDma_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/mcuxClDma_Drv.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/mcuxClDma_FeatureConfig.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/mcuxClDma_Resource.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/mcuxClDma_Sfr.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/mcuxClDma_SfrAccess.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/mcuxClDma_Utils.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/mcuxClDma_Utils_Sgi.h" projectpath="component/sgi_pkc/src/comps/mcuxClDma/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClDma/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClDma/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="doc" Csub="sgi_pkc_ecc" Cversion="1.0.0" condition="component.sgi_pkc.ecc.condition_id">
      <description>Component sgi_pkc.ecc</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Constants.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_ECDH_KeyAgreement.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_ECDSA_GenerateSignature.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_ECDSA_GenerateSignature_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_ECDSA_Internal_PrepareMessageDigest.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_ECDSA_VerifySignature.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_ECDSA_VerifySignature_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_GenerateKeyPair.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_GenerateKeyPair_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_GenerateSignature.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_GenerateSignature_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_GenerateSignatureMode.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_InitPrivKeyInputMode.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_CalcHashModN_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_DecodePoint_Ed25519.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_DecodePoint_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_EncodePoint.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_HashOperations.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_InputParamSanityCheck.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_SetupEnvironment.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_Internal_SignatureMechanisms.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_EdDSA_VerifySignature.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_BlindedFixScalarMult.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_BlindedVarScalarMult.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_Convert_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_GenerateMultiplicativeBlinding.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_GenerateMultiplicativeBlinding_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_IntegrityCheckPN.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_Interleave_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_InterleaveScalar.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_InterleaveTwoScalars.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_PointComparison_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_Random.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_Random_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_RecodeAndReorderScalar.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_SecurePointSelectML.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_SecurePtrTableEntrySelect.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_SetupEnvironment.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_SetupEnvironment_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Internal_Types.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_KeyEncodingMechanisms.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_KeyTypes.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_KeyValidation.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Mont_Internal_DhSetupEnvironment.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Mont_Internal_MontDhX.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Mont_Internal_MontDhX_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Mont_Internal_SecureScalarMult_XZMontLadder.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Mont_Internal_SecureScalarMult_XZMontLadder_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_MontDH_GenerateKeyPair.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_MontDH_KeyAgreement.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_SignatureMechanisms.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_Convert_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_FixScalarMult.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PlainFixScalarMult25519.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PlainPtrSelectComb.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PlainPtrSelectML.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PlainVarScalarMult.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PointArithmetic.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PointArithmetic_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PointArithmeticEd25519.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PointArithmeticEd25519_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PointSubtraction_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_PointValidation_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_SecureFixScalarMult25519.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_SecurePtrSelectComb.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_SecureVarScalarMult.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_UpdateExtHomCoords_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_VarScalarMult.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_TwEd_Internal_VarScalarMult_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_BooleanToArithmeticMasking.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_BooleanToArithmeticMasking_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_ConvertPoint.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_ConvertPoint_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_DiscriminantCalculate_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_DomainParamsCheck.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_KeyGen.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_KeyGen_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_PlainFixScalarMult.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_PointArithmetic.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_PointArithmetic_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_PointCheck.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_PointCheck_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_PointMult.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_SecurePointMult_CoZMontLadder.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_Internal_SecurePointMult_CoZMontLadder_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_KeyGen_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_Weier_PointMult_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_WeierECC_Internal_DecodePoint.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_WeierECC_Internal_DecodePoint_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_WeierECC_Internal_EncTypeSEC.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_WeierECC_Internal_GenerateCustomKeyType.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_WeierECC_Internal_GenerateDomainParams.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_WeierECC_Internal_GenerateDomainParams_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_WeierECC_Internal_GenerateKeyPair.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/mcuxClEcc_WeierECC_Internal_SetupEnvironment.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClEcc/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_ECDSA_GenerateSignature_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_ECDSA_VerifySignature_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_EdDSA_GenerateKeyPair_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_EdDSA_GenerateSignature_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_EdDSA_Internal_CalcHashModN_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_EdDSA_Internal_DecodePoint_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Internal_Convert_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
