vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA185_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_hash_modes" Cversion="1.0.0" condition="component.sgi_pkc.examples_hash_modes.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha224_oneshot_example.c" projectpath="component/sgi_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha256_longMsgOneshot_example.c" projectpath="component/sgi_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha256_oneshot_example.c" projectpath="component/sgi_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha256_streaming_example.c" projectpath="component/sgi_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha384_oneshot_example.c" projectpath="component/sgi_pkc/examples/mcuxClHashModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClHashModes/mcuxClHashModes_sha512_oneshot_example.c" projectpath="component/sgi_pkc/examples/mcuxClHashModes"/>
        <file category="include" name="components/sgi_pkc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_hmac" Cversion="1.0.0" condition="component.sgi_pkc.examples_hmac.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClHmac/mcuxClHmac_Sw_Multipart_example.c" projectpath="component/sgi_pkc/examples/mcuxClHmac"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClHmac/mcuxClHmac_Sw_Oneshot_example.c" projectpath="component/sgi_pkc/examples/mcuxClHmac"/>
        <file category="include" name="components/sgi_pkc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_key" Cversion="1.0.0" condition="component.sgi_pkc.examples_key.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClKey/mcuxClKey_Load_Flush_Sgi_example.c" projectpath="component/sgi_pkc/examples/mcuxClKey"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClKey/mcuxClKey_Rewrap_Rfc3394_Sgi_example.c" projectpath="component/sgi_pkc/examples/mcuxClKey"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClKey/mcuxClKey_Unwrap_Rfc3394_Sgi_example.c" projectpath="component/sgi_pkc/examples/mcuxClKey"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClKey/mcuxClKey_Wrap_Rfc3394_Sgi_kwkAlreadyLoaded_example.c" projectpath="component/sgi_pkc/examples/mcuxClKey"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClKey/mcuxClKey_WrapAndLoad_Rfc3394_Sgi_example.c" projectpath="component/sgi_pkc/examples/mcuxClKey"/>
        <file category="include" name="components/sgi_pkc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_mac_modes" Cversion="1.0.0" condition="component.sgi_pkc.examples_mac_modes.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClMacModes/mcuxClMacModes_Cmac_Aes128_Compute_example.c" projectpath="component/sgi_pkc/examples/mcuxClMacModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClMacModes/mcuxClMacModes_Cmac_Aes128_Compute_PreloadedKey_example.c" projectpath="component/sgi_pkc/examples/mcuxClMacModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClMacModes/mcuxClMacModes_Cmac_Aes128_Multipart_example.c" projectpath="component/sgi_pkc/examples/mcuxClMacModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClMacModes/mcuxClMacModes_Cmac_Aes256_Compute_example.c" projectpath="component/sgi_pkc/examples/mcuxClMacModes"/>
        <file category="include" name="components/sgi_pkc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_memory" Cversion="1.0.0" condition="component.sgi_pkc.examples_memory.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxCsslMemory/mcuxCsslMemory_Clear_example.c" projectpath="component/sgi_pkc/examples/mcuxCsslMemory"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxCsslMemory/mcuxCsslMemory_Compare_example.c" projectpath="component/sgi_pkc/examples/mcuxCsslMemory"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxCsslMemory/mcuxCsslMemory_Copy_example.c" projectpath="component/sgi_pkc/examples/mcuxCsslMemory"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxCsslMemory/mcuxCsslMemory_SecureSet_example.c" projectpath="component/sgi_pkc/examples/mcuxCsslMemory"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxCsslMemory/mcuxCsslMemory_Set_example.c" projectpath="component/sgi_pkc/examples/mcuxCsslMemory"/>
        <file category="header" name="components/sgi_pkc/examples/mcuxCsslMemory/inc/mcuxCsslMemory_Examples.h" projectpath="component/sgi_pkc/examples/mcuxCsslMemory/inc"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/sgi_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
